[{"type": "Rice", "name": "Knorr Rice Sides Cheddar Broccoli Rice Cooks in 7 Minutes No Artificial Flavors, 5.7 oz", "brand": "Knorr", "averageRating": 4.5, "shortDescription": "Treat your taste buds to Knorr Rice Sides Cheddar Broccoli. Your family is sure to love the flavor of our Rice Sides Cheddar Broccoli, our rice and pasta blend that expertly combines broccoli florets with the creamy goodness of a cheddar cheese sauce. On top of tasting delicious, our Cheddar Broccoli rice side dish is quick and easy to prepare. Knorr rice side dishes cook in just 7 minutes on the stovetop or in the microwave, and they’re perfect as the base for a delicious main dish or as a standalone rice side dish. Make Knorr Rice Sides the foundation of a crowd-pleasing dinner or an easy meal.", "price": 1.34}, {"type": "Jerky & Dried Meats", "name": "Slim Jim Original Smoked Snack Sized Sticks Pantry Pack, 0.28 oz. Meat Sticks, 46-ct Box", "brand": "Slim Jim", "averageRating": 4.5, "shortDescription": "Experience intense  smoky flavor with a delicious Slim Jim Original Smoked Snack Stick Pantry Pack. Made with beef, pork and chicken, these irresistible meat sticks contain no artificial flavors or colors for full meaty flavor everyone can love. Each savory snack stick serving is loaded with 6 grams of protein, ideal for protein snacks that kick hunger to the curb and leave you feeling satisfied. These individually wrapped snacks go where you go and are perfect as travel snacks, school snacks or anywhere meat snacks. Slim Jim Original Snack Size Sticks offer a bold and tasty way to take on the day and make great pantry food items. This pantry pack box contains 46 individual snacks, so you are ready to clap back when savory cravings hit. Snap into a Slim Jim!", "price": 11.84}, {"type": "Juices", "name": "Great Value 100% Orange Juice, 10 fl oz, 6 Count", "brand": "Great Value", "averageRating": 3.3, "shortDescription": "Orange Juice from Concentrate with Vitamin CGreat Value Orange 100% Juice six-count pack is the perfect solution for busy individuals who want to enjoy the wholesome taste of orange juice with the convenience of single-serving bottles. Each 10-ounce bottle contains 100% daily value of vitamin C, making this juice a healthy and refreshing choice. Pack individual bottles in lunch boxes, gym bags, backpacks, and coolers for a convenient and healthy drink option on the go, or add to your favorite fruit smoothie for a little extra punch. Since the six-count pack doesn't require refrigeration until after opening, you can stock up for school parties, sporting events, and camping trips. For maximum enjoyment, chill and shake before serving. This kosher and fat-free beverage is sure to satisfy just about anyone. Great Value Orange 100% Juice six-count pack delivers convenient and enjoyable refreshment at home and on the go!Great Value products provide families with affordable, high quality grocery and household consumable options. With our wide range of product categories spanning grocery and household consumables, we offer you a variety of products for your family's needs. Our products are conveniently available online and in Walmart stores nationwide, allowing you to stock up and save money at the same time.", "price": 4.46}, {"type": "Juices", "name": "Dole All Natural 100% Pineapple Juice Can, 6 fl oz, 6 Count", "brand": "Dole", "averageRating": 4.4, "shortDescription": "<h2>Enjoy the refreshing taste of 100% pineapple juice!</h2><p>Dole 100% Pineapple Juice is packed in an easy-to-open can, keeping it fresh and ready to be enjoyed at any time. Rich in Vitamin C and made with no added sugar, Dole Pineapple Juice is made with the nutritional goodness of real fruit, making it the ideal tropical fruit juice to enjoy on its own or mixed in cocktails, mocktails, or smoothies. With Dole's shelf-stable products, you can have the delicious taste of refreshing fruit anywhere, anytime.</p>", "price": 3.98}, {"type": "Juices", "name": "Ocean Spray® White Cran-Strawberry Juice Drink, 64 fl oz Bottle", "brand": "Ocean Spray", "averageRating": 4.1, "shortDescription": "Sweeten the moment with Ocean Spray® White Cran-Strawberry Juice Drink. Light and refreshing meets crisp and bold with this blend of white cranberry and strawberry juices. This fruit juice beverage packs 100% of your recommended daily value of vitamin C in a single serving. Enjoy the sweet, tasty flavor of white cranberry juice and strawberry juice concentrate. Did we mention Ocean Spray® White Cran-Strawberry Juice Drink is made with no high fructose corn syrup? It's truly a win-win. Use this cranberry juice drink as a cocktail mixer for elevated drinks, or serve it cold on its own. White Cranberry makes a delicious, unique addition to blended beverages and ice pops, too. Go ahead and get creative. This juice drink won't let you down. All this made possible by the 700+ cranberry farming families that make up our co-op. Our owners. Our heartbeat. Our inspiration. Ocean Spray believes in the power of the mighty cranberry; Born Tart. Raised Bold.™", "price": 3.36}, {"type": "Rice", "name": "Minute Instant White Rice, Light and Fluffy, 42 oz", "brand": "Minute", "averageRating": 4.8, "shortDescription": "Delicious, Quality Rice In Minutes\n\nMinute Instant White Rice is classic white rice known for its distinctive light and fluffy texture. Fast and delicious, Minute Instant White Rice contains one ingredient: rice. Mix it up and make it yours by seasoning it and eating it by itself or eating it alongside chicken, meat, vegetables, or any recipes you have in mind! Ready in only five minutes, you can spend less time cooking and have more time to enjoy all the moments that happen when you slow down. Minute Instant White Rice is cholesterol-free, made without MSG and preservatives, Non-GMO Project Verified, and Certified Gluten-Free.", "price": 6.17}, {"type": "Juices", "name": "Capri Sun Fruit Punch Juice Box Pouches, 30 ct Box, 6 fl oz Pouches", "brand": "Capri Sun", "averageRating": 4.6, "shortDescription": "Grab a little juicy freedom with Capri Sun Fruit Punch Flavored Juice Drink Blend. Made with the all-natural sweetener, monk fruit, our Fruit Punch juice drink blend has the lush, sweet flavors of apples, pineapples and oranges that are joyfully refreshing. Kids love the taste of Capri Sun, made with all natural ingredients. We never add artificial flavors, colors, preservatives or high-fructose corn syrup to our pouches. Each 6 fluid ounce pouch in our 30 count box comes with a straw, so they're ready for kids to squeeze and sip. Unleash kids' independence with a ready-to-drink Capri Sun.", "price": 9.43}, {"type": "Juices", "name": "Capri Sun Strawberry Kiwi Juice Box Pouches, 10 ct Box, 6 fl oz Pouches", "brand": "Capri Sun", "averageRating": 4.7, "shortDescription": "Grab a little juicy freedom with Capri Sun Strawberry Kiwi Flavored with other natural flavor Juice Drink Blend. Made with the all-natural sweetener, monk fruit, our Strawberry Kiwi juice drink blend has ripe strawberries and tart kiwis for a flavor that’s joyfully refreshing. Kids love the taste of Capri Sun, made with all natural ingredients. We never add artificial flavors, colors, preservatives or high-fructose corn syrup to our pouches. Each 6 fluid ounce pouch in our 10 count box comes with a straw, so they're ready for kids to squeeze and sip. Unleash kids' independence with a ready-to-drink Capri Sun.", "price": 3.18}, {"type": "Snack Crackers", "name": "Handi-Snacks RITZ Crackers 'N Cheesy Dip Snack Packs, 12 Snack Packs", "brand": "Handi-Snacks", "averageRating": 4.1, "shortDescription": "Handi-Snacks RITZ Crackers and Cheese Dip Snack Packs pair crunchy RITZ crackers with creamy cheese to make the perfect savory snack. These delicious snack packs take classic RITZ crackers and the taste of smooth cheese and transform it into a fun, dippable treat. Toss one of these cracker packs into your lunchbox as a tasty snack, or stash them in your travel pack as a fun road trip treat. Each of these individually wrapped cheese and crackers snack packs features handy compartments for the salted crackers and the cheesy dip to keep everything in place, whether you're snacking at home, work, school or on the road.", "price": 6.48}, {"type": "Juices", "name": "Ocean Spray® Cran-Apple™ Cranberry Apple Juice Drink, 101.4 fl oz Bottle", "brand": "Ocean Spray", "averageRating": 4.4, "shortDescription": "Radically refreshing. Unapologetically bold. Ocean Spray® Cran-Apple™ Cranberry Apple Juice Drink has a fresh, zingy taste to quench the strongest thirst. The sweet flavor of apples and the crisp, tart taste of cranberries make this apple and cranberry juice beverage a bucket list item all on its own. With 100% of your recommended daily value of vitamin C and no high fructose corn syrup, it's a full punch of flavor without compromise. Made from real fruit juice concentrate, it's low sodium and fat-free. Stir Cran-Apple™ into your favorite drinks as a cocktail mixer, freeze into ice pops, or enjoy straight from the bottle. We won't judge. All this made possible by the 700+ cranberry farming families that make up our co-op. Our owners. Our heartbeat. Our inspiration. Ocean Spray believes in the power of the mighty cranberry; Born Tart. Raised Bold.™", "price": 4.87}, {"type": "Cookies", "name": "NABISCO OREO CAKESTERS ORIGINAL COOKIES 10.1 OZ", "brand": "Oreo", "averageRating": 3.9, "shortDescription": "OREO Cakesters are a delicious, soft-baked twist on a classic sweet treat. These OREO snack cakes sandwich creme filling between two soft-baked chocolate cakes, making them great snacks for all ages. Each snack pack of OREO Cakesters includes 2 soft snack cakes that are ideal as adult lunch snacks, birthday treats or office snacks.", "price": 3.98}, {"type": "Snack Crackers", "name": "RITZ Fresh Stacks Original Crackers, Party Size, 23.7 oz (16 Stacks)", "brand": "RITZ Crackers", "averageRating": 4.6, "shortDescription": "RITZ Fresh Stacks Original Crackers have a rich, buttery flavor that's perfect for pairing, topping or popping. No matter the occasion, these tasty round crackers make a great snack food, appetizer or quick meal. Keep RITZ snack crackers on your shelf of salty snacks for an easy anytime treat. Each 23.7 ounce party size box of Ritz Original Crackers contains eight individually wrapped cracker packs.", "price": 5.98}, {"type": "Cookies", "name": "Nutter Butter Double Nutty Peanut Butter Sandwich Cookies, Family Size, 15.27 oz", "brand": "Nutter Butter", "averageRating": 4.5, "shortDescription": "Nutter Butter Peanut Butter Sandwich Cookies satisfy the peanut butter lovers in your family with a snack that's ready to enjoy. Made with real peanut butter, these cookies have a crunchy texture and a smooth, twice the creamy filling between two crispy cookies for a sweet and savory snack. These sandwich cookies come in a peanut shape, making snacking fun for all ages. Pack these peanut butter snacks in small bags for cookies to go, or open the entire pack for cookie snacks to share with the whole family. Nutter Butter cookies come in a resealable 15.27 ounce cookie packs to keep these family size snacks fresh until you're ready to enjoy.", "price": 4.68}, {"type": "Juices", "name": "Ocean Spray® White Cran-Peach Juice Drink, 64 fl oz Bottle", "brand": "Ocean Spray", "averageRating": 4.5, "shortDescription": "Sweeten the moment with Ocean Spray® White Cran-Peach Juice Drink. Light and refreshing meets crisp and bold with this blend of white cranberry and peach juices. This fruit juice beverage packs 100% of your recommended daily value of vitamin C in a single serving. Enjoy the sweet, tasty flavor of white cranberry juice and peach juice concentrate. Did we mention Ocean Spray® White Cran-Peach Juice Drink is made with no high fructose corn syrup? It's truly a win-win. Use this cranberry juice drink as a cocktail mixer for elevated drinks, or serve it cold on its own. White Cranberry makes a delicious, unique addition to blended beverages and ice pops, too. Go ahead and get creative. This juice drink won't let you down. All this made possible by the 700+ cranberry farming families that make up our co-op. Our owners. Our heartbeat. Our inspiration. Ocean Spray believes in the power of the mighty cranberry; Born Tart. Raised Bold.™", "price": 3.36}, {"type": "Juices", "name": "Ocean Spray® Cran-Raspberry® Cranberry Raspberry Juice Drink, 101.4 fl oz Bottle", "brand": "Ocean Spray", "averageRating": 4.3, "shortDescription": "Radically refreshing. Unapologetically bold. Ocean Spray® Cran-Raspberry® Cranberry Raspberry Juice Drink has a fresh, zingy taste to quench the strongest thirst. The sweet flavor of raspberries and the crisp, tart taste of cranberries make this raspberry and cranberry juice beverage a bucket list item all on its own. With 100% of your recommended daily value of vitamin C and no high fructose corn syrup, it's a full punch of flavor without compromise. Made from real fruit juice concentrate, it's low sodium and fat-free. Stir Cran-Raspberry® into your favorite drinks as a cocktail mixer, freeze into ice pops, or enjoy straight from the bottle. We won't judge. All this made possible by the 700+ cranberry farming families that make up our co-op. Our owners. Our heartbeat. Our inspiration. Ocean Spray believes in the power of the mighty cranberry; Born Tart. Raised Bold.™", "price": 4.87}, {"type": "Snack Crackers", "name": "Premium Original Soup & Oyster Crackers, 9 oz", "brand": "Premium", "averageRating": 4.4, "shortDescription": "Premium Original Soup and Oyster Crackers add a delicious crunch to your favorite soups. With the familiar flavor you know, these mini crackers have a light, crunchy texture, making them a delicious complement to so many dishes. These Kosher salted crackers contain no cholesterol and no saturated fat. Grab a handful for a salty snack, or add them to your favorite soup as an alternative to traditional soda crackers, chowder or chili to enhance the flavor. These saltine crackers are ideally bite-sized and come sealed in a 9 ounce package to keep them fresh until you're ready to enjoy.", "price": 3.58}, {"type": "Cookies", "name": "Nutter Butter Peanut Butter Wafer Cookies, 10.5 oz", "brand": "Nutter Butter", "averageRating": 4.3, "shortDescription": "Nutter Butter Peanut Butter Wafer Cookies satisfy the peanut butter lovers in your family with a snack that's ready to enjoy. Made with real peanut butter, these cookies have a crunchy texture and a smooth, creamy filling between two crispy wafers for a sweet and savory snack. These sweet snacks come in a square shape, making them stand out among other Nutter Butter cookies. Toss the cookie packs in lunches, enjoy them as a quick afternoon snack or try dipping them in milk. Sealed packaging keeps these cookie snacks fresh until you're ready to enjoy.", "price": 4.68}, {"type": "Cookies", "name": "OREO Chocolate Sandwich Cookies, 12 Snack Packs", "brand": "Oreo", "averageRating": 4.8, "shortDescription": "Take a delicious break with OREO Chocolate Sandwich Cookies. Supremely dunkable, OREO cookies sandwich a rich creme filling between two chocolate wafers--making them milk's favorite cookie. Original OREO cookies are great snack cookies for packing in school lunches, or mixing into a milkshake. These cookie snack packs are perfect for snacking, sharing, or traveling.", "price": 6.74}, {"type": "Juices", "name": "Welch's 100% Grape Juice, Concord Grape, 96 fl oz Bottle", "brand": "Welch's", "averageRating": 4.7, "shortDescription": "<p>Welch's 100% Grape Juice delivers the bold, delicious taste of Concord grapes in every glass. You can trust the goodness of Welch's: There's two servings of fruit and 100% Daily Value of Vitamin C per 8 oz. serving, with no added sugar, flavors, colors or preservatives. And you can feel great about buying Welch's, because we're owned by family farmers who have been farming their land for as many as seven generations. This is a single 96 fl. oz. bottle of juice.</p>", "price": 7.22}, {"type": "Rice", "name": "Mahatma Authentic Saffron Yellow Rice, Seasoned Rice with Spices, 10 oz Bag", "brand": "Mahatma Rice", "averageRating": 3.8, "shortDescription": "Mahatma Rice Unites\n\nMahatma Authentic Saffron Yellow Rice is blended with spices, onions, and garlic. When cooking rice, the long grain rice granules maintain their separate, long shape and become fluffy, so you can use them alongside your favorite rice dishes, like burritos, tacos, and Spanish-inspired paella. This rice recipe isn't too spicy, plus it's fat-free, cholesterol-free, and made without added preservatives. Mahatma Authentic Saffron Yellow Rice is Certified Gluten-Free and Certified Kosher by Star-K.", "price": 9.81}, {"type": "Snack Crackers", "name": "Town House Original Oven Baked Crackers, 20.7 oz", "brand": "Town House", "averageRating": 3.3, "shortDescription": "Elevate snacking, entertaining, and everyday celebrations year-round with classic Town House Original oven baked crackers. These uniquely flaky crackers are a satisfying stand-alone snack. They also go great with tasty toppings like goat cheese, preserves, and chicken salad. Made with delicious ingredients, they're cholesterol free (3g polyunsaturated fat, 1g monounsaturated fat) and low in saturated fat (contains 5g total fat per serving); Every box of savory crackers is an invitation to explore all kinds of exciting ingredient combinations, ready to take your moments with family and friends over the top. Serve up a delicious treat, enjoy as a school snack or afternoon snack, or set out a spread that feels a bit more special for party goers. Make iconic Kellogg's Town House Original oven baked crackers your first choice. Shelf-Stable.<p>Town House Original Oven Baked Crackers, 20.7 oz:</p>", "price": 4.98}, {"type": "Snack Crackers", "name": "Cheez-It Original Cheese Crackers, 28 oz, 2 Count", "brand": "Kellogg's", "averageRating": 4.5, "shortDescription": "Outrageously cheesy and ridiculously craveable, Cheez-It baked snack crackers are deliciously crunchy little crackers that have captured cheese-lovers for decades. Discover a crowd-favorite snack made with 100% real cheese baked to crispy perfection for an irresistible taste in every crunchy bite. Each lightly salted cracker is loaded with a burst of cheesy flavor; Cheez-It baked snack crackers are a fan-favorite for game night, school snacks, family movie nights, party spreads, late-night snacking, and so much more, the cheesy options are endless. Delicious for all ages, grab a box of Cheez-It Original crackers for every family snacking moment. Whether you're packing them in school lunches, grabbing some for the office, or taking along on a road trip, you'll find a delicious, crisp snack that is filled with big cheese flavor. It’s no wonder that these bite-sized crackers have become a crowd-favorite, bringing smiles and that urge for just one more handful. Shelf-Stable.<p>Cheez-It Original Cheese Crackers, 28 oz, 2 Count:</p>", "price": 7.54}, {"type": "Cookies", "name": "Ginger Snaps Cookies, Ginger Cookies, 16 oz", "brand": "Nabisco", "averageRating": 4.1, "shortDescription": "Ginger Snaps Cookies make it easy to enjoy a classic treat without baking from scratch. Made with real ginger and molasses, Nabisco Ginger Snaps have a classic flavor. Crispy round cookie snacks offer a classic crunchy texture for snacking satisfaction. They're the ideal size to grab for a snack or to enjoy with your tea. These ginger cookies also work to make a homemade pie crust for pumpkin or apple baked desserts. Keep a box of Ginger Snaps Cookies on hand, so you're always prepared for a sweet craving.", "price": 6.24}, {"type": "Rice", "name": "Carolina Jasmine White Rice, Thai Fragrant Long Grain Rice, 5 lb Bag", "brand": "Carolina", "averageRating": 4.5, "shortDescription": "Indulge in all the sweet and savory flavor of Carolina Long-Grain Jasmine White Rice. When cooked, our rice is decadently fluffy and gives off a fragrant, slightly buttery aroma to add flavor to any recipe. Our jasmine rice is crafted to separate evenly after cooking to prevent clumping and easily absorb your favorite seasonings. Add Carolina Jasmine Rice to rice salads, rice bowls, rice pudding, stir fry, fried rice, and more. Carolina Long-Grain White Rice is Non-GMO Project Verified, gluten-free, sodium-free, fat-free, cholesterol-free, and made without MSG or preservatives. For delicious cooked rice, choose Carolina Jasmine Rice.", "price": 6.2}, {"type": "Rice", "name": "Iberia Jasmine Long Grain Enriched Fragrant Rice, 5 lbs", "brand": "Iberia", "averageRating": 3.5, "shortDescription": "Enhance your favorite dishes with healthy ingredients such as this Iberia Jasmine Long Grain Enriched Fragrant Rice, 5 lbs. This product is low in sodium and low in fat, making it a suitable choice for weight watchers and those with restricted diets. This long grain rice can be added to a wide variety of recipes. It can also be cooked on its own to complement your favorite dishes.", "price": 6.92}, {"type": "Juices", "name": "Ocean Spray® Pink Cranberry Juice Cocktail, 64 fl oz Bottle", "brand": "Ocean Spray", "averageRating": 4.6, "shortDescription": "Pink. Light. Radically refreshing. Quench your thirst with Ocean Spray® Pink Cranberry Juice Cocktail. This crisp, flavorful drink is made from real fruit juice concentrate from pink, white and red cranberries. It's a light and refreshing take on original Cranberry Juice Cocktail. This real fruit juice beverage is an excellent source of vitamin C. All with only 100 calories per serving. It's the good stuff without compromise. Use Pink Cranberry Juice Cocktail as a cocktail mixer. Serve it on the rocks with a splash of vodka for a refreshing cranberry cocktail. Mix it with some tonic to add a pop of flavor to mocktail drinks. Of course, it's always delicious on its own. All this made possible by the 700+ cranberry farming families that make up our co-op. Our owners. Our heartbeat. Our inspiration. Ocean Spray believes in the power of the mighty cranberry; Born Tart. Raised Bold.™", "price": 12.98}, {"type": "Rice", "name": "Goya Cnilla Rice Par Bld (12x5LB )", "brand": "Canilla", "averageRating": 4.3, "shortDescription": "Golden Canilla Parboiled Rice is a delicious addition to your kitchen. You can use it to accompany enchiladas and other Mexican dishes, or enjoy it with your favorite type of cuisine. Goya parboiled rice is fast and easy to cook up on your stove or in the microwave. It has just 170 calories per serving, which makes it easy to factor into your well-managed diet plan.", "price": 4.67}, {"type": "Juices", "name": "Welch's Mango Twist Juice Cocktail, 96 fl oz Bottle", "brand": "Welch's", "averageRating": 4.4, "shortDescription": "<p>Welch's Mango Twist Cocktail is deliciously fruity. You can trust the goodness of Welch's: It's made with real fruit juice, and there's 100% Daily Value of Vitamin C per serving. And you can feel great about buying Welch's, because we're owned by family farmers who have been farming their land for as many as seven generations. This is a single 96 fl. oz. bottle of juice.</p>", "price": 4.78}, {"type": "Juices", "name": "(3 Cans) Dole All Natural 100% Pineapple Juice, 46 fl oz Can", "brand": "Dole", "averageRating": 4.3, "shortDescription": "<h2>Enjoy the refreshing taste of 100% pineapple juice!</h2><p>Dole 100% Pineapple Juice is packed in an easy-to-open can, keeping it fresh and ready to enjoy at any time. Rich in Vitamin C and made with no added sugar, Dole Pineapple Juice is made with the nutritional goodness of real fruit, making it the ideal tropical fruit juice to enjoy on its own - or mixed in cocktails, mocktails, or smoothies. With Dole's shelf-stable products, you can have the delicious taste of refreshing fruit anywhere, anytime.</p>", "price": 8.78}, {"type": "Juices", "name": "(24 Bottles) Tropicana 3 Flavor Classic Variety Pack, 10 fl oz", "brand": "Tropicana", "averageRating": 4.6, "shortDescription": "<ul><li>Contains twenty-four (24) 10 oz. bottles of assorted Tropicana fruit blend drinks</li><li>This variety pack includes three 100% juice flavors (8 bottles each) - Orange, Apple and Fruit Medley</li><li>Tropicana Juice is the perfect beverage to pack in lunches or drink on the go</li><li>Add these Tropicana Juices to your daily routine for a delicious and convenient source of vitamin C</li><li>Each bottle contains 100% of your daily value of Vitamin C. Easy to store, pack, and enjoy on the go</li></ul>", "price": 17.79}, {"type": "Snack Crackers", "name": "Goldfish Elf Maple Syrup Flavored Graham Crackers, Snack Crackers, 6.1 oz Bag", "brand": "Goldfish", "averageRating": 5, "shortDescription": "New limited-edition Goldfish Elf Maple Syrup Flavored Graham Crackers will bring smiles and spread holiday cheer to snack time just in time for the beloved holiday movie's 20th Anniversary. You’ll find irresistibly delicious taste in every fun-shaped bite of our new seasonal graham crackers. Enjoy flavors of sweet brown sugar and butter, with the taste of caramel and vanilla, inspired by syrup - one of the elves' four main food groups. The 6.1-ounce bag is the perfect snack for your Elf movie watch party with family and friends, or for a sweet afternoon snack anytime the mood hits. They also make a great stocking stuffer or are ready for sharing at your next holiday get-together. These limited-edition maple syrup graham crackers featuring traditional Goldfish and iconic shapes inspired by Buddy the Elf will spark holiday cheer in everyone. New limited-edition Goldfish Elf Maple Syrup Flavored Graham Crackers. Go for the handful!", "price": 11.49}, {"type": "Packaged Meals", "name": "Rice-a-Roni Rice & Vermicelli Mix, Chicken & Broccoli, 4.9 oz Box", "brand": "Rice-A-Roni", "averageRating": 4.6, "shortDescription": "Our Rice-A-Roni products combine rice, pasta and the perfect mix of seasonings to create delicious, family pleasing side dishes and main dish recipes. Your family will fly to the table for the great taste of rice and vermicelli blended with onions, parsley, garlic and chicken broth! Prepare for a stampede to the dinner table when you serve our delicious rice and vermicelli blended with the savory flavors of onions, carrots, beef broth and garlic! Our rice and pasta blend seasoned with spices pairs perfectly with your family’s favorite go-to dinner.", "price": 5.23}, {"type": "Snack Crackers", "name": "Combos, Pepperoni Pizza Cracker, Count 1 - Snacks / Grab Varieties & Flavors", "brand": "Combos", "averageRating": 3.5, "shortDescription": "Combos, Pepperoni Pizza Cracker, Count 1 - Snacks / Grab Varieties &amp; Flavors", "price": 6.7}, {"type": "Snack Crackers", "name": "Goldfish Disney Mickey Mouse Cheddar Crackers, Snack Crackers, 30 oz Carton", "brand": "Goldfish", "averageRating": 4.8, "shortDescription": "A special twist on the irresistible little snack that always delights! The whole family will have fun snacking on Goldfish Disney Mickey Mouse Cheddar cheese crackers, with a mix of classic Goldfish and red Mickey shapes. They’re baked with 100% real Cheddar cheese and made with colors sourced from plants. Talk about a feel-good snack! These Mickey Mouse-inspired snack crackers are as fun as it gets. And they make the perfect anytime snack - after school, on the weekends or whenever you just spend time together. Snack time with friends is always sure to end up in smiles all around. Plus, they’re every bit as good at lunch as they are for a crunchable, munchable snack. Add them to soups, sprinkle them on salads or just simply munch on them as a fun side with your sandwich. Expect everyone to come back for more. Go for the handful!", "price": 23.48}, {"type": "Juices", "name": "Ace Aloe Juice 12-Pack", "brand": "Ace", "averageRating": 4.7, "shortDescription": "Premium Aloe vera juice, Naturally flavored, No preservatives, Plenty of Aloe vera gel Pulp included. Contains less sugar than other leading brands.", "price": 26.4}, {"type": "Snack Chips", "name": "Doritos Nacho Cheese Tortilla Snack Chips,Party Size, 14.5 oz Bag", "brand": "Doritos", "averageRating": 4.7, "shortDescription": "DORITOS isn’t just a chip. It’s fuel for disruption — our flavors ignite adventure and inspire action. With every crunch of these nacho cheese tortilla chips, we aim to redefine culture and support those who are boldly themselves. Are you ready? If so, crunch on. These crispy tortilla chips are perfect for sharing with family and friends.", "price": 4.93}, {"type": "Beef", "name": "All Natural* 80% Lean/20% Fat Ground Beef Chuck, 1 lb Tray", "brand": "Fresh Ground Beef", "averageRating": 2.1, "shortDescription": "There's nothing like cooking from scratch, especially when you start with All Natural* 80% Lean/20% Fat Ground Beef Chuck Tray. Made with quality USDA inspected beef and no artificial ingredients, our all natural* ground beef is juicy, tender and wet aged for flavor. Our beef is an excellent source of protein, vitamin B6, vitamin B12, zinc, niacin, selenium and a good source of phosphorous, riboflavin and iron. All 9 essential nutrients are naturally found in beef and are a flavorful way to give your body nutrients to help power through the day. Great for sautéing or grilling, our ground beef is a delicious addition to your favorite recipes. Simply cook and serve with asparagus, bow tie pasta and pesto sauce for a hearty weeknight dinner. Includes one All Natural* 80% Lean/20% Fat Ground Beef Chuck Tray. *Minimally processed, no artificial ingredients", "price": 4.97}, {"type": "Chicken", "name": "Great Value All Natural Chicken Wing Sections, 4 lb (Frozen)", "brand": "Great Value", "averageRating": null, "shortDescription": "Bring home the taste of game day with all-natural* Great Value Chicken Wing Sections.  Our chickens are raised with no added hormones,** and these ice glazed, individually frozen chicken wing sections are ready to cook. Our all-natural* chicken is juicy and tender with 19g of protein and 0g of trans fat per serving. Simply bake or grill anytime to crispy perfection. Toss with buffalo or garlic parmesan sauce and serve with celery and carrots for a classic, crowd-pleasing appetizer. These are the perfect size for dipping into your favorite condiment. Bake and finish on the grill for perfectly charred wings that pair with corn on the cob and chipotle dip. For a special occasion, get creative and baste in a honey-garlic sauce for a twist. Includes one 4 lb reclosable package of all-natural* chicken wing sections. *Minimally processed, no artificial ingredients **Federal regulations prohibit the use of added hormones or steroids in chicken", "price": 12.98}, {"type": "Snack Chips", "name": "Ruffles Original Potato Snack Chips,Party Size, 13 oz Bag", "brand": "Ruffles", "averageRating": 3.7, "shortDescription": "Back in the day chips were flat and that was boring. So we made a chip that zigged and zagged and shared it with the world. Because when you have ridges, the crunches are crunchier and the dipping strength multiplies, and your chips become Ruffles. With crunchy ridges and epic inspired flavors, RUFFLES potato chips bring snack satisfaction and big taste to any moment.", "price": 5.48}, {"type": "Rice", "name": "Mahatma Authentic Saffron Yellow Rice, Seasoned Rice with Spices, 5 oz Bag", "brand": "Mahatma", "averageRating": 4.2, "shortDescription": "Mahatma Rice Unites\n\nMahatma Authentic Saffron Yellow Rice is blended with spices, onions, and garlic. When cooking rice, the long grain rice granules maintain their separate, long shape and become fluffy, so you can use them alongside your favorite rice dishes, like burritos, tacos, and Spanish-inspired paella. This rice recipe isn't too spicy, plus it's fat-free, cholesterol-free, and made without added preservatives. Mahatma Authentic Saffron Yellow Rice is Certified Gluten-Free and Certified Kosher by Star-K.", "price": 6.26}]